RepairsApi.Tests/E2ETests/Requests/DRSConfirmBooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns1="http://autogenerated.OTBackgroundService.xmbrace.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns1:bookingConfirmation>
            <bookingConfirmation>
                <bookingId>982461</bookingId>
                <bookingReason>Tenant changed</bookingReason>
                <bookingSequence>FIRST</bookingSequence>
                <changedDate>2021-05-27T14:21:01</changedDate>
                <contract>H01</contract>
                <locationID>99999992</locationID>
                <numberOfOperatives>1</numberOfOperatives>
                <originalBookingId>982461</originalBookingId>
                <planningWindowEnd>{{planningWindowEnd}}</planningWindowEnd>
                <planningWindowStart>{{planningWindowStart}}</planningWindowStart>
                <primaryOrderNumber>{{workOrderId}}</primaryOrderNumber>
                <secondaryOrderNumber/>
                <targetDate>2021-06-05T00:00:00</targetDate>
                <tertiaryOrderNumber/>
                <theBookingCodes>
                    <bookingId>982461</bookingId>
                    <orderId>862410</orderId>
                    <bookingCodeSORCode>20060020</bookingCodeSORCode>
                    <primaryOrderNumber>{{workOrderId}}</primaryOrderNumber>
                    <quantity>1</quantity>
                    <standardMinuteValue>76</standardMinuteValue>
                    <itemNumberWithinBooking>1</itemNumberWithinBooking>
                    <itemValue>57</itemValue>
                    <trade>PL</trade>
                    <bookingCodeDescription>A booking code description</bookingCodeDescription>
                </theBookingCodes>
                <tokenId>dxWSATxbDm7maIgX0Yn69JrBtgF6fxi1VZJIx7QH</tokenId>
                <userId>createARepair</userId>
            </bookingConfirmation>
        </ns1:bookingConfirmation>
    </soapenv:Body>
</soapenv:Envelope>
